app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
    	$startdate = (empty($request->startdate) ? now()->firstOfMonth() : $request->startdate);
    	$enddate = (empty($request->enddate) ? now() : $request->enddate);

    	$data = Perkembangan::selectRaw('
    		sum(drops) as sum_drop,
    		sum(psp) as sum_psp,
    		sum(storting) as sum_storting,
    		sum(drop_tunda) as sum_drop_tunda,
    		sum(storting_tunda) as sum_storting_tunda,
    		sum(tkp) as sum_tkp,
    		sum(sisa_kas) as sum_sisa_kas')
    	->whereMonth('tanggal',date('m'))
    	->first();

    	if($request->ajax())
    	{
    		$labels = [];
    		$chart = Perkembangan::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas,cabang')
    		->where('tanggal','>=',$request->startdate)
    		->where('tanggal','<=',$request->enddate)
    		->groupBy('cabang')
    		->get();

    		$dataFilter = Perkembangan::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas')
    		->where('tanggal','>=',$request->startdate)
    		->where('tanggal','<=',$request->enddate)
    		->first();
---
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas from `perkembangans` where `tanggal` >= '2021-11-01' and `tanggal` <= '2021-11-24' limit 1
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas,cabang from `perkembangans` where `tanggal` >= '2021-11-01' and `tanggal` <= '2021-11-24' group by `cabang`