app/Http/Controllers/PerkembanganController.php

    public function cabang(Request $request)
    {
    	$user = auth()->user();
    	if($user->getRoleNames()->first() == 'admin')
    	{
    		$cabang = KantorCabang::pluck('cabang','id');
    	}

    	if($user->getRoleNames()->first() == 'user')
    	{
    		$cabang = KantorCabang::where('id', $user->cabang_id )->pluck('cabang','id');
    	}

    	if($request->ajax()){
    		$pecah = explode( '/',$request->tanggal);
    		$tanggal = Carbon::createFromFormat('Y/m/d', $request->tanggal."/01");
    		$getBulan = $tanggal->isoFormat('MMMM YYYY');
    		$getTanggal = $request->tanggal."/01";
    		$tahun = $pecah[0];
    		$bulan = $pecah[1];

    		$dashboard = Perkembangan::selectRaw('sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp')
    		->where('cabang', $request->cabang)
    		->whereMonth('tanggal',$bulan)
    		->whereYear('tanggal',$tahun)
    		->first();
    		// dd($dashboard);
    		$kasTerbaru = Perkembangan::where('cabang', $request->cabang)
    		->whereMonth('tanggal',$bulan)
    		->whereYear('tanggal',$tahun)
    		->latest()->first();

			//PENCAPAIAN
    		$target = ProgramKerja::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas')
    		->whereMonth('tanggal',$bulan)
    		->whereYear('tanggal',$tahun)
    		->where('cabang', $request->cabang)
    		->first();

    		$pencapaian =  Perkembangan::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas')
    		->whereMonth('tanggal',$bulan)
    		->whereYear('tanggal',$tahun)
    		->where('cabang', $request->cabang)
    		->first();
---
select sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp from `perkembangans` where `cabang` = '31' and month(`tanggal`) = '11' and year(`tanggal`) = '2021' limit 1
select * from `perkembangans` where `cabang` = '31' and month(`tanggal`) = '11' and year(`tanggal`) = '2021' order by `created_at` desc limit 1
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas from `program_kerjas` where month(`tanggal`) = '11' and year(`tanggal`) = '2021' and `cabang` = '31' limit 1
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas from `perkembangans` where month(`tanggal`) = '11' and year(`tanggal`) = '2021' and `cabang` = '31' limit 1

    		$perbandingaLables = $jmlHari = $dataLabel =[];
    		$bulanKemarin = $tanggal->subMonth(1)->format('m');

    		$perbandingan = Perkembangan::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas,
    			tanggal,
    			MONTH(tanggal) as bulan,
    			DAY(tanggal) as hari')
    		->whereIn(DB::raw('MONTH(tanggal)'),[$bulanKemarin,$bulan])
    		->where('cabang', $request->cabang)
    		->whereYear('tanggal',$tahun)
    		->groupBy('tanggal')
    		->get();
---
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas,
tanggal,
MONTH(tanggal) as bulan,
DAY(tanggal) as hari from `perkembangans` where MONTH(tanggal) in ('10', '11') and `cabang` = '31' and year(`tanggal`) = '2021' group by `tanggal`

    		$perbandinganLabels = json_encode($dataLabel);


    		$pencapaianBulanLalu =  Perkembangan::selectRaw('
    			sum(drops) as sum_drop,
    			sum(psp) as sum_psp,
    			sum(storting) as sum_storting,
    			sum(drop_tunda) as sum_drop_tunda,
    			sum(storting_tunda) as sum_storting_tunda,
    			sum(tkp) as sum_tkp,
    			sum(sisa_kas) as sum_sisa_kas')
    		->whereMonth('tanggal',$bulanKemarin)
    		->where('cabang', $request->cabang)
    		->first();
---
select
sum(drops) as sum_drop,
sum(psp) as sum_psp,
sum(storting) as sum_storting,
sum(drop_tunda) as sum_drop_tunda,
sum(storting_tunda) as sum_storting_tunda,
sum(tkp) as sum_tkp,
sum(sisa_kas) as sum_sisa_kas from `perkembangans` where month(`tanggal`) = '10' and `cabang` = '31' limit 1